Repository: DesparionX/MyLibrary
Catalog: MyLibrary/Resources/Languages/Strings.*.resx
Languages: bg

# Splash_Loading
source: Loading...
bg: Зареждане...

# Splash_CheckingAPI
source: Checking API...
bg: Проверка на API...

# Splash_CheckingDB
source: Checking DB...
bg: Проверка на БД...

# Splash_LoadingComplete
source: Starting...
bg: Стартиране...

source: Error
bg: Грешка

# Splash_APIChecksFailed
source: Health check failed. Please check your API and Database connection.
bg: Няма връзка със АПИ-то или базата данни.

# Validators_Email_Invalid
source: Email is not valid.
bg: Невалиден имейл.

# Validators_Password_NullOrEmpty
source: Password cannot be null or empty.
bg: Полето за паролата не трябва да е празно.

# Validators_Password_MinChars
source: Password must be at least 8 characters long.
bg: Паролата трябва да е поне 8 символа.

# Validators_Password_MaxChars
source: Password must be at most 20 characters long.
bg: Паролата трябва да е максимум 20 символа.

# Validators_Password_OneUppercase
source: Password must contain at least one uppercase letter.
bg: Паролата трябва да съдържа поне една главна буква.

# Validators_Password_OneLowercase
source: Password must contain at least one lowercase letter.
bg: Паролата трябва да съдържа поне една малка буква.

# Validators_Username_NullOrEmpty
source: Username cannot be null or empty.
bg: Потребителското име не може да е празно.

# Validators_Username_MinChars
source: Username must be at least 3 characters long.
bg: Потребителското име трябва да е поне 3 символа.

# Validators_Username_MaxChars
source: Username must be at most 30 characters long.
bg: Потребителското име трябва да е максимум 30 символа.

# Validators_Username_LettersAndDigits
source: Username can only contain letters and digits.
bg: Потребителското име трябва да се състои само от букви и цифри.

# Errors_NavigatingToWindow
source: Error navigating to window:
bg: Грешка при опита за отваряне на нов прозорец:

# Errors_AuthService_ClearingUserIdentity
source: Error clearing user identity.
bg: Грешка при изчистването на потребителя.

# Errors_AuthHeader_FailedSendingRequest
source: An error occurred while sending the request:
bg: Възникна грешка при изпращането на искането:

# Errors_UserService_LoginFailed
source: Login failed.
bg: Неуспешен вход.

# Errors_UserService_InvalidResponse
source: Invalid response from server.
bg: Невалиден отговор от сървъра.

# LogIn_Email
source: Email
bg: Имейл

# LogIn_Password
source: Password
bg: Парола

# LogIn_LogInButton
source: Log In
bg: Вход

# Errors_NavigatingToView
source: Error navigating to view:
bg: Грешка при смяна на страницата:

# Errors_ClosingApp
source: Error closing the app.
bg: Грешка при затварянето на програмата.

# Home_BorrowBooks
source: Borrow
bg: Заемане

# Home_Sell
source: Sell
bg: Продажба

# Home_ReturnBooks
source: Return
bg: Връщане

# Sell_Validations_NullOrder
source: Order cannot be null.
bg: Поръчката не може да е празна.

# BookService_Errors_ErrorFetchingBookByID
source: Error fetching book by ID.
bg: Грешка при намирането на книга по ИН.

# Sell_Validations_ID_NullOrWhiteSpace
source: Item ID cannot be null.
bg: Липсва ИН.

# Sell_Validations_ISBN_NullOrWhiteSpace
source: ISBN cannot be null.
bg: Липсва ISBN.

# Sell_Validations_ItemNotFound
source: No item with such ID/ISBN.
bg: Няма намерен предмет с този ИН/ISBN.

# Sell_Validations_NullQuantity
source: Quantity must be at least 1.
bg: Трябва да маркирате поне 1 предмет.

# BookService_Errors_ErrorFetchingBookByISBN
source: Error fetching book by ISBN.
bg: Грешка при намирането на книга по ISBN.

# Book_Details_ID
source: ID:
bg: ИН:

# Book_Details_Title
source: Title:
bg: Заглавие:

# Book_Details_Genre
source: Genre:
bg: Жанр:

# Book_Details_Author
source: Author:
bg: Автор:

# Book_Details_Publisher
source: Publisher:
bg: Издател:

# Recipe_Header_Name
source: Title
bg: Заглавие

# Recipe_Header_Price
source: Price
bg: Цена/бр

# Recipe_Header_Quantity
source: Quantity
bg: Количество

# Book_Details_Description
source: Description:
bg: Описание:

# Recipe_Header_Total
source: Total
bg: Общо

# Errors_Receipt_ZeroOrders
source: No items in the receipt. Please add items before finalizing the sale.
bg: Моля добавете артикули преди да финализирате продажбата.

# Errors_Receipt_ISBNNotFound
source: No item found with given ISBN.
bg: Няма намерен продукт с този ISBN.

# Errors_Receipt_EmptyISBN
source: ISBN cannot be empty.
bg: Моля въведете ISBN.

# CustomDialog_OK
source: OK
bg: Добре

# CustomDialog_Confirm
source: Confirm
bg: Потвърди

# CustomDialog_Cancel
source: Cancel
bg: Отказ

# CustomDialog_Title_Success
source: Success !
bg: Успех !

# CustomDialog_Title_Fail
source: Error !
bg: Грешка !

# FileService_Errors_InvalidFilePath
source: File path is invalid or file does not exist.
bg: Пътят до файла е неправилен или файлът не съществува.

# FileService_Errors_InvalidFileType
source: Invalid file type. Allowed types are:
bg: Файлът е с грешен формат. Трябва да бъде:

# FileService_Errors_InvalidFileSize
source: File size exceeds the maximum limit of 5MB.
bg: Файлът надхвърля максималният обем от 5МБ.

# Receipt_AddNewItem_NotFoundOrNotAvailable
source: The book is either not found, or out of stock.
bg: Книгата не съществува или не е налична.

# Book_Details_Borrower
source: Borrower:
bg: Ползвател:

# Buttons_Find
source: Find
bg: Търси

# Buttons_Return
source: Return
bg: Върни

# Buttons_Borrow
source: Borrow
bg: Заеми

# TextBoxes_BookID
source: Book ID
bg: ИН на книгата

# Validators_BookId_Invalid
source: Invalid Book ID.
bg: Невалиден ИН.

# Errors_Api_NullResponse
source: API response was null.
bg: Отговора от АПИ-то е празен.

# Errors_Borrows_FailedToGetBorrow
source: Failed to get borrow from the DB.
bg: Неуспешно извличане на записа.

# Borrows_Validations_EmptyID
source: ID field cannot be empty.
bg: Полето за ИН не може да е празно.

# Borrows_Validations_InvalidID
source: This is not a valid ID.
bg: Това не е валиден ИН.

# Borrows_Successfully_Borrowed
source: Book borrowed successfully.
bg: Книгата е заета успешно.

# Borrows_Failed_To_Borrow
source: Book borrow failed.
bg: Неуспешно заемане на книгата.

# Errors_Book_Already_Returned
source: Book is already returned, or not borrowed at all.
bg: Книгата е вече върната или изобщо не е заемана.

# Return_Book_Returned_Successfully
source: Book returned successfully.
bg: Книгата е върната успешно.
